Autodesk.Revit.DB.UnitUtils.ConvertPointToInternalUnits(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ForgeTypeId)
Converts a point from a given unit to Revit's internal units.
point:
The point to convert.
unitTypeId:
Identifier of the unit quantifying the value.
Returns:
The converted point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertPointFromInternalUnits(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ForgeTypeId)
Converts a point from Revit's internal units to a given unit.
point:
The point to convert.
unitTypeId:
Identifier of the desired unit.
Returns:
The converted point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetForgeStorageUnit(Autodesk.Revit.DB.ForgeTypeId)
Retrieves the storage unit of the measurable Forge spec.
This is not the Revit internal unit. It is the unit declared in the
Forge spec schema itself.
specTypeId:
The measurable spec.
Returns:
The storage unit of the measurable Forge spec.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.3